Learning rate:  0.001
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
separable_conv1d_1 (SeparableCo (None, 6000, 8)      65          input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 2000, 8)      0           separable_conv1d_1[0][0]         
__________________________________________________________________________________________________
separable_conv1d_2 (SeparableCo (None, 2000, 16)     216         max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 667, 16)      0           separable_conv1d_2[0][0]         
__________________________________________________________________________________________________
separable_conv1d_3 (SeparableCo (None, 667, 16)      384         max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 223, 16)      0           separable_conv1d_3[0][0]         
__________________________________________________________________________________________________
separable_conv1d_4 (SeparableCo (None, 223, 32)      656         max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 112, 32)      0           separable_conv1d_4[0][0]         
__________________________________________________________________________________________________
separable_conv1d_5 (SeparableCo (None, 112, 64)      2272        max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 56, 64)       0           separable_conv1d_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 56, 64)       256         max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 56, 64)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 56, 16)       1040        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 56, 16)       64          conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 56, 16)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 56, 16)       0           activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 56, 16)       784         spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 56, 16)       64          conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 56, 16)       0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 56, 64)       1088        activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 56, 64)       0           max_pooling1d_5[0][0]            
                                                                 conv1d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 56, 64)       256         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 56, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 56, 16)       1040        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 56, 16)       64          conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 56, 16)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 56, 16)       0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 56, 16)       784         spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 56, 16)       64          conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 56, 16)       0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 56, 64)       1088        activation_6[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 56, 64)       0           add_1[0][0]                      
                                                                 conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 56, 64)       256         add_2[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 56, 64)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 56, 16)       1040        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 56, 16)       64          conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 56, 16)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 56, 16)       0           activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 56, 16)       784         spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 56, 16)       64          conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 56, 16)       0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 56, 64)       1088        activation_9[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 56, 64)       0           add_2[0][0]                      
                                                                 conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 56, 64)       256         add_3[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 56, 64)       0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 56, 16)       1040        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 56, 16)       64          conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 56, 16)       0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 56, 16)       0           activation_11[0][0]              
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 56, 16)       528         spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 56, 16)       64          conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 56, 16)       0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 56, 64)       1088        activation_12[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 56, 64)       0           add_3[0][0]                      
                                                                 conv1d_12[0][0]                  
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 56, 32)       10368       add_4[0][0]                      
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 56, 16)       528         bidirectional_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 56, 16)       64          conv1d_13[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 56, 32)       4224        batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 56, 16)       528         bidirectional_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 56, 16)       64          conv1d_14[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 56, 16), (No 1089        batch_normalization_14[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 56, 16)       0           batch_normalization_14[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 56, 16)       32          add_5[0][0]                      
__________________________________________________________________________________________________
feed_forward_1 (FeedForward)    (None, 56, 16)       4240        layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_6 (Add)                     (None, 56, 16)       0           layer_normalization_1[0][0]      
                                                                 feed_forward_1[0][0]             
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 56, 16)       32          add_6[0][0]                      
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 56, 16), (No 1089        layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 56, 16)       0           layer_normalization_2[0][0]      
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 56, 16)       32          add_7[0][0]                      
__________________________________________________________________________________________________
feed_forward_2 (FeedForward)    (None, 56, 16)       4240        layer_normalization_3[0][0]      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 56, 16)       0           layer_normalization_3[0][0]      
                                                                 feed_forward_2[0][0]             
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 56, 16)       32          add_8[0][0]                      
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 56, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 56, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 56, 16), (No 1089        lstm_3[0][0]                     
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 56, 16), (No 1089        lstm_4[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_1 (UpSampling1D)  (None, 112, 16)      0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
up_sampling1d_6 (UpSampling1D)  (None, 112, 16)      0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_11 (UpSampling1D) (None, 112, 16)      0           attentionS[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_6 (SeparableCo (None, 112, 64)      1136        up_sampling1d_1[0][0]            
__________________________________________________________________________________________________
separable_conv1d_11 (SeparableC (None, 112, 64)      1136        up_sampling1d_6[0][0]            
__________________________________________________________________________________________________
separable_conv1d_16 (SeparableC (None, 112, 64)      1136        up_sampling1d_11[0][0]           
__________________________________________________________________________________________________
up_sampling1d_2 (UpSampling1D)  (None, 224, 64)      0           separable_conv1d_6[0][0]         
__________________________________________________________________________________________________
up_sampling1d_7 (UpSampling1D)  (None, 224, 64)      0           separable_conv1d_11[0][0]        
__________________________________________________________________________________________________
up_sampling1d_12 (UpSampling1D) (None, 224, 64)      0           separable_conv1d_16[0][0]        
__________________________________________________________________________________________________
cropping1d_1 (Cropping1D)       (None, 223, 64)      0           up_sampling1d_2[0][0]            
__________________________________________________________________________________________________
cropping1d_4 (Cropping1D)       (None, 223, 64)      0           up_sampling1d_7[0][0]            
__________________________________________________________________________________________________
cropping1d_7 (Cropping1D)       (None, 223, 64)      0           up_sampling1d_12[0][0]           
__________________________________________________________________________________________________
separable_conv1d_7 (SeparableCo (None, 223, 32)      2400        cropping1d_1[0][0]               
__________________________________________________________________________________________________
separable_conv1d_12 (SeparableC (None, 223, 32)      2400        cropping1d_4[0][0]               
__________________________________________________________________________________________________
separable_conv1d_17 (SeparableC (None, 223, 32)      2400        cropping1d_7[0][0]               
__________________________________________________________________________________________________
up_sampling1d_3 (UpSampling1D)  (None, 669, 32)      0           separable_conv1d_7[0][0]         
__________________________________________________________________________________________________
up_sampling1d_8 (UpSampling1D)  (None, 669, 32)      0           separable_conv1d_12[0][0]        
__________________________________________________________________________________________________
up_sampling1d_13 (UpSampling1D) (None, 669, 32)      0           separable_conv1d_17[0][0]        
__________________________________________________________________________________________________
cropping1d_2 (Cropping1D)       (None, 667, 32)      0           up_sampling1d_3[0][0]            
__________________________________________________________________________________________________
cropping1d_5 (Cropping1D)       (None, 667, 32)      0           up_sampling1d_8[0][0]            
__________________________________________________________________________________________________
cropping1d_8 (Cropping1D)       (None, 667, 32)      0           up_sampling1d_13[0][0]           
__________________________________________________________________________________________________
separable_conv1d_8 (SeparableCo (None, 667, 16)      688         cropping1d_2[0][0]               
__________________________________________________________________________________________________
separable_conv1d_13 (SeparableC (None, 667, 16)      688         cropping1d_5[0][0]               
__________________________________________________________________________________________________
separable_conv1d_18 (SeparableC (None, 667, 16)      688         cropping1d_8[0][0]               
__________________________________________________________________________________________________
up_sampling1d_4 (UpSampling1D)  (None, 2001, 16)     0           separable_conv1d_8[0][0]         
__________________________________________________________________________________________________
up_sampling1d_9 (UpSampling1D)  (None, 2001, 16)     0           separable_conv1d_13[0][0]        
__________________________________________________________________________________________________
up_sampling1d_14 (UpSampling1D) (None, 2001, 16)     0           separable_conv1d_18[0][0]        
__________________________________________________________________________________________________
cropping1d_3 (Cropping1D)       (None, 2000, 16)     0           up_sampling1d_4[0][0]            
__________________________________________________________________________________________________
cropping1d_6 (Cropping1D)       (None, 2000, 16)     0           up_sampling1d_9[0][0]            
__________________________________________________________________________________________________
cropping1d_9 (Cropping1D)       (None, 2000, 16)     0           up_sampling1d_14[0][0]           
__________________________________________________________________________________________________
separable_conv1d_9 (SeparableCo (None, 2000, 16)     384         cropping1d_3[0][0]               
__________________________________________________________________________________________________
separable_conv1d_14 (SeparableC (None, 2000, 16)     384         cropping1d_6[0][0]               
__________________________________________________________________________________________________
separable_conv1d_19 (SeparableC (None, 2000, 16)     384         cropping1d_9[0][0]               
__________________________________________________________________________________________________
up_sampling1d_5 (UpSampling1D)  (None, 6000, 16)     0           separable_conv1d_9[0][0]         
__________________________________________________________________________________________________
up_sampling1d_10 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_14[0][0]        
__________________________________________________________________________________________________
up_sampling1d_15 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_19[0][0]        
__________________________________________________________________________________________________
separable_conv1d_10 (SeparableC (None, 6000, 8)      248         up_sampling1d_5[0][0]            
__________________________________________________________________________________________________
separable_conv1d_15 (SeparableC (None, 6000, 8)      248         up_sampling1d_10[0][0]           
__________________________________________________________________________________________________
separable_conv1d_20 (SeparableC (None, 6000, 8)      248         up_sampling1d_15[0][0]           
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          separable_conv1d_10[0][0]        
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          separable_conv1d_15[0][0]        
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          separable_conv1d_20[0][0]        
==================================================================================================
Total params: 64,320
Trainable params: 63,488
Non-trainable params: 832
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 2618s 436ms/step - loss: 0.0163 - detector_loss: 0.0588 - picker_P_loss: 0.0120 - picker_S_loss: 0.0150 - detector_f1: 0.8167 - picker_P_f1: 0.1374 - picker_S_f1: 0.0553 - val_loss: 0.0025 - val_detector_loss: 0.0172 - val_picker_P_loss: 0.0029 - val_picker_S_loss: 0.0038 - val_detector_f1: 0.9468 - val_picker_P_f1: 0.5566 - val_picker_S_f1: 0.3217

Epoch 00001: val_loss improved from inf to 0.00249, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 2526s 421ms/step - loss: 0.0066 - detector_loss: 0.0288 - picker_P_loss: 0.0052 - picker_S_loss: 0.0054 - detector_f1: 0.9119 - picker_P_f1: 0.3775 - picker_S_f1: 0.2452 - val_loss: 0.0021 - val_detector_loss: 0.0102 - val_picker_P_loss: 0.0024 - val_picker_S_loss: 0.0035 - val_detector_f1: 0.9645 - val_picker_P_f1: 0.6573 - val_picker_S_f1: 0.3606

Epoch 00002: val_loss improved from 0.00249 to 0.00209, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_002.h5
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 2498s 416ms/step - loss: 0.0060 - detector_loss: 0.0248 - picker_P_loss: 0.0048 - picker_S_loss: 0.0050 - detector_f1: 0.9248 - picker_P_f1: 0.4430 - picker_S_f1: 0.3058 - val_loss: 0.0017 - val_detector_loss: 0.0087 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9711 - val_picker_P_f1: 0.6665 - val_picker_S_f1: 0.4152

Epoch 00003: val_loss improved from 0.00209 to 0.00172, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_003.h5
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 2526s 421ms/step - loss: 0.0058 - detector_loss: 0.0228 - picker_P_loss: 0.0045 - picker_S_loss: 0.0049 - detector_f1: 0.9314 - picker_P_f1: 0.4678 - picker_S_f1: 0.3364 - val_loss: 0.0019 - val_detector_loss: 0.0076 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9732 - val_picker_P_f1: 0.6828 - val_picker_S_f1: 0.4254

Epoch 00004: val_loss did not improve from 0.00172
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 2484s 414ms/step - loss: 0.0056 - detector_loss: 0.0216 - picker_P_loss: 0.0044 - picker_S_loss: 0.0048 - detector_f1: 0.9341 - picker_P_f1: 0.4832 - picker_S_f1: 0.3522 - val_loss: 0.0015 - val_detector_loss: 0.0070 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9760 - val_picker_P_f1: 0.6878 - val_picker_S_f1: 0.4728

Epoch 00005: val_loss improved from 0.00172 to 0.00151, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_005.h5
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 2483s 414ms/step - loss: 0.0054 - detector_loss: 0.0206 - picker_P_loss: 0.0043 - picker_S_loss: 0.0047 - detector_f1: 0.9360 - picker_P_f1: 0.4940 - picker_S_f1: 0.3720 - val_loss: 0.0022 - val_detector_loss: 0.0083 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9735 - val_picker_P_f1: 0.6687 - val_picker_S_f1: 0.4174

Epoch 00006: val_loss did not improve from 0.00151
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 2491s 415ms/step - loss: 0.0053 - detector_loss: 0.0201 - picker_P_loss: 0.0042 - picker_S_loss: 0.0046 - detector_f1: 0.9391 - picker_P_f1: 0.5023 - picker_S_f1: 0.3781 - val_loss: 0.0015 - val_detector_loss: 0.0124 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9601 - val_picker_P_f1: 0.6722 - val_picker_S_f1: 0.4113

Epoch 00007: val_loss improved from 0.00151 to 0.00149, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_007.h5
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 3148s 525ms/step - loss: 0.0053 - detector_loss: 0.0198 - picker_P_loss: 0.0042 - picker_S_loss: 0.0046 - detector_f1: 0.9386 - picker_P_f1: 0.5079 - picker_S_f1: 0.3854 - val_loss: 0.0016 - val_detector_loss: 0.0085 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9707 - val_picker_P_f1: 0.6785 - val_picker_S_f1: 0.4378

Epoch 00008: val_loss did not improve from 0.00149
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 2983s 497ms/step - loss: 0.0051 - detector_loss: 0.0185 - picker_P_loss: 0.0041 - picker_S_loss: 0.0045 - detector_f1: 0.9433 - picker_P_f1: 0.5159 - picker_S_f1: 0.3943 - val_loss: 0.0018 - val_detector_loss: 0.0068 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9756 - val_picker_P_f1: 0.6847 - val_picker_S_f1: 0.4329

Epoch 00009: val_loss did not improve from 0.00149
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 2508s 418ms/step - loss: 0.0051 - detector_loss: 0.0186 - picker_P_loss: 0.0041 - picker_S_loss: 0.0045 - detector_f1: 0.9431 - picker_P_f1: 0.5181 - picker_S_f1: 0.3990 - val_loss: 0.0036 - val_detector_loss: 0.0060 - val_picker_P_loss: 0.0019 - val_picker_S_loss: 0.0031 - val_detector_f1: 0.9786 - val_picker_P_f1: 0.6785 - val_picker_S_f1: 0.4663

Epoch 00010: val_loss did not improve from 0.00149