Learning rate:  0.001
Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
separable_conv1d_113 (Separable (None, 6000, 8)      65          input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_29 (MaxPooling1D) (None, 3000, 8)      0           separable_conv1d_113[0][0]       
__________________________________________________________________________________________________
separable_conv1d_114 (Separable (None, 3000, 16)     216         max_pooling1d_29[0][0]           
__________________________________________________________________________________________________
max_pooling1d_30 (MaxPooling1D) (None, 1500, 16)     0           separable_conv1d_114[0][0]       
__________________________________________________________________________________________________
separable_conv1d_115 (Separable (None, 1500, 16)     384         max_pooling1d_30[0][0]           
__________________________________________________________________________________________________
max_pooling1d_31 (MaxPooling1D) (None, 750, 16)      0           separable_conv1d_115[0][0]       
__________________________________________________________________________________________________
separable_conv1d_116 (Separable (None, 750, 32)      656         max_pooling1d_31[0][0]           
__________________________________________________________________________________________________
max_pooling1d_32 (MaxPooling1D) (None, 375, 32)      0           separable_conv1d_116[0][0]       
__________________________________________________________________________________________________
separable_conv1d_117 (Separable (None, 375, 32)      1216        max_pooling1d_32[0][0]           
__________________________________________________________________________________________________
max_pooling1d_33 (MaxPooling1D) (None, 188, 32)      0           separable_conv1d_117[0][0]       
__________________________________________________________________________________________________
separable_conv1d_118 (Separable (None, 188, 64)      2272        max_pooling1d_33[0][0]           
__________________________________________________________________________________________________
max_pooling1d_34 (MaxPooling1D) (None, 94, 64)       0           separable_conv1d_118[0][0]       
__________________________________________________________________________________________________
separable_conv1d_119 (Separable (None, 94, 64)       4352        max_pooling1d_34[0][0]           
__________________________________________________________________________________________________
max_pooling1d_35 (MaxPooling1D) (None, 47, 64)       0           separable_conv1d_119[0][0]       
__________________________________________________________________________________________________
batch_normalization_69 (BatchNo (None, 47, 64)       256         max_pooling1d_35[0][0]           
__________________________________________________________________________________________________
activation_61 (Activation)      (None, 47, 64)       0           batch_normalization_69[0][0]     
__________________________________________________________________________________________________
conv1d_69 (Conv1D)              (None, 47, 16)       1040        activation_61[0][0]              
__________________________________________________________________________________________________
batch_normalization_70 (BatchNo (None, 47, 16)       64          conv1d_69[0][0]                  
__________________________________________________________________________________________________
activation_62 (Activation)      (None, 47, 16)       0           batch_normalization_70[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 47, 16)       0           activation_62[0][0]              
__________________________________________________________________________________________________
conv1d_70 (Conv1D)              (None, 47, 16)       784         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
batch_normalization_71 (BatchNo (None, 47, 16)       64          conv1d_70[0][0]                  
__________________________________________________________________________________________________
activation_63 (Activation)      (None, 47, 16)       0           batch_normalization_71[0][0]     
__________________________________________________________________________________________________
conv1d_71 (Conv1D)              (None, 47, 64)       1088        activation_63[0][0]              
__________________________________________________________________________________________________
add_37 (Add)                    (None, 47, 64)       0           max_pooling1d_35[0][0]           
                                                                 conv1d_71[0][0]                  
__________________________________________________________________________________________________
batch_normalization_72 (BatchNo (None, 47, 64)       256         add_37[0][0]                     
__________________________________________________________________________________________________
activation_64 (Activation)      (None, 47, 64)       0           batch_normalization_72[0][0]     
__________________________________________________________________________________________________
conv1d_72 (Conv1D)              (None, 47, 16)       1040        activation_64[0][0]              
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 47, 16)       64          conv1d_72[0][0]                  
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 47, 16)       0           batch_normalization_73[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 47, 16)       0           activation_65[0][0]              
__________________________________________________________________________________________________
conv1d_73 (Conv1D)              (None, 47, 16)       784         spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 47, 16)       64          conv1d_73[0][0]                  
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 47, 16)       0           batch_normalization_74[0][0]     
__________________________________________________________________________________________________
conv1d_74 (Conv1D)              (None, 47, 64)       1088        activation_66[0][0]              
__________________________________________________________________________________________________
add_38 (Add)                    (None, 47, 64)       0           add_37[0][0]                     
                                                                 conv1d_74[0][0]                  
__________________________________________________________________________________________________
batch_normalization_75 (BatchNo (None, 47, 64)       256         add_38[0][0]                     
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 47, 64)       0           batch_normalization_75[0][0]     
__________________________________________________________________________________________________
conv1d_75 (Conv1D)              (None, 47, 16)       1040        activation_67[0][0]              
__________________________________________________________________________________________________
batch_normalization_76 (BatchNo (None, 47, 16)       64          conv1d_75[0][0]                  
__________________________________________________________________________________________________
activation_68 (Activation)      (None, 47, 16)       0           batch_normalization_76[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_23 (SpatialDr (None, 47, 16)       0           activation_68[0][0]              
__________________________________________________________________________________________________
conv1d_76 (Conv1D)              (None, 47, 16)       784         spatial_dropout1d_23[0][0]       
__________________________________________________________________________________________________
batch_normalization_77 (BatchNo (None, 47, 16)       64          conv1d_76[0][0]                  
__________________________________________________________________________________________________
activation_69 (Activation)      (None, 47, 16)       0           batch_normalization_77[0][0]     
__________________________________________________________________________________________________
conv1d_77 (Conv1D)              (None, 47, 64)       1088        activation_69[0][0]              
__________________________________________________________________________________________________
add_39 (Add)                    (None, 47, 64)       0           add_38[0][0]                     
                                                                 conv1d_77[0][0]                  
__________________________________________________________________________________________________
batch_normalization_78 (BatchNo (None, 47, 64)       256         add_39[0][0]                     
__________________________________________________________________________________________________
activation_70 (Activation)      (None, 47, 64)       0           batch_normalization_78[0][0]     
__________________________________________________________________________________________________
conv1d_78 (Conv1D)              (None, 47, 16)       1040        activation_70[0][0]              
__________________________________________________________________________________________________
batch_normalization_79 (BatchNo (None, 47, 16)       64          conv1d_78[0][0]                  
__________________________________________________________________________________________________
activation_71 (Activation)      (None, 47, 16)       0           batch_normalization_79[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_24 (SpatialDr (None, 47, 16)       0           activation_71[0][0]              
__________________________________________________________________________________________________
conv1d_79 (Conv1D)              (None, 47, 16)       528         spatial_dropout1d_24[0][0]       
__________________________________________________________________________________________________
batch_normalization_80 (BatchNo (None, 47, 16)       64          conv1d_79[0][0]                  
__________________________________________________________________________________________________
activation_72 (Activation)      (None, 47, 16)       0           batch_normalization_80[0][0]     
__________________________________________________________________________________________________
conv1d_80 (Conv1D)              (None, 47, 64)       1088        activation_72[0][0]              
__________________________________________________________________________________________________
add_40 (Add)                    (None, 47, 64)       0           add_39[0][0]                     
                                                                 conv1d_80[0][0]                  
__________________________________________________________________________________________________
batch_normalization_81 (BatchNo (None, 47, 64)       256         add_40[0][0]                     
__________________________________________________________________________________________________
activation_73 (Activation)      (None, 47, 64)       0           batch_normalization_81[0][0]     
__________________________________________________________________________________________________
conv1d_81 (Conv1D)              (None, 47, 16)       1040        activation_73[0][0]              
__________________________________________________________________________________________________
batch_normalization_82 (BatchNo (None, 47, 16)       64          conv1d_81[0][0]                  
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 47, 16)       0           batch_normalization_82[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_25 (SpatialDr (None, 47, 16)       0           activation_74[0][0]              
__________________________________________________________________________________________________
conv1d_82 (Conv1D)              (None, 47, 16)       528         spatial_dropout1d_25[0][0]       
__________________________________________________________________________________________________
batch_normalization_83 (BatchNo (None, 47, 16)       64          conv1d_82[0][0]                  
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 47, 16)       0           batch_normalization_83[0][0]     
__________________________________________________________________________________________________
conv1d_83 (Conv1D)              (None, 47, 64)       1088        activation_75[0][0]              
__________________________________________________________________________________________________
add_41 (Add)                    (None, 47, 64)       0           add_40[0][0]                     
                                                                 conv1d_83[0][0]                  
__________________________________________________________________________________________________
bidirectional_9 (Bidirectional) (None, 47, 32)       10368       add_41[0][0]                     
__________________________________________________________________________________________________
conv1d_84 (Conv1D)              (None, 47, 16)       528         bidirectional_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_84 (BatchNo (None, 47, 16)       64          conv1d_84[0][0]                  
__________________________________________________________________________________________________
bidirectional_10 (Bidirectional (None, 47, 32)       4224        batch_normalization_84[0][0]     
__________________________________________________________________________________________________
conv1d_85 (Conv1D)              (None, 47, 16)       528         bidirectional_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_85 (BatchNo (None, 47, 16)       64          conv1d_85[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 47, 16), (No 1089        batch_normalization_85[0][0]     
__________________________________________________________________________________________________
add_42 (Add)                    (None, 47, 16)       0           batch_normalization_85[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_17 (LayerNo (None, 47, 16)       32          add_42[0][0]                     
__________________________________________________________________________________________________
feed_forward_9 (FeedForward)    (None, 47, 16)       4240        layer_normalization_17[0][0]     
__________________________________________________________________________________________________
add_43 (Add)                    (None, 47, 16)       0           layer_normalization_17[0][0]     
                                                                 feed_forward_9[0][0]             
__________________________________________________________________________________________________
layer_normalization_18 (LayerNo (None, 47, 16)       32          add_43[0][0]                     
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 47, 16), (No 1089        layer_normalization_18[0][0]     
__________________________________________________________________________________________________
add_44 (Add)                    (None, 47, 16)       0           layer_normalization_18[0][0]     
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_19 (LayerNo (None, 47, 16)       32          add_44[0][0]                     
__________________________________________________________________________________________________
feed_forward_10 (FeedForward)   (None, 47, 16)       4240        layer_normalization_19[0][0]     
__________________________________________________________________________________________________
add_45 (Add)                    (None, 47, 16)       0           layer_normalization_19[0][0]     
                                                                 feed_forward_10[0][0]            
__________________________________________________________________________________________________
layer_normalization_20 (LayerNo (None, 47, 16)       32          add_45[0][0]                     
__________________________________________________________________________________________________
lstm_19 (LSTM)                  (None, 47, 16)       2112        layer_normalization_20[0][0]     
__________________________________________________________________________________________________
lstm_20 (LSTM)                  (None, 47, 16)       2112        layer_normalization_20[0][0]     
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_19[0][0]                    
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_20[0][0]                    
__________________________________________________________________________________________________
up_sampling1d_85 (UpSampling1D) (None, 94, 16)       0           layer_normalization_20[0][0]     
__________________________________________________________________________________________________
up_sampling1d_92 (UpSampling1D) (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_99 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_120 (Separable (None, 94, 64)       1136        up_sampling1d_85[0][0]           
__________________________________________________________________________________________________
separable_conv1d_127 (Separable (None, 94, 64)       1136        up_sampling1d_92[0][0]           
__________________________________________________________________________________________________
separable_conv1d_134 (Separable (None, 94, 64)       1136        up_sampling1d_99[0][0]           
__________________________________________________________________________________________________
up_sampling1d_86 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_120[0][0]       
__________________________________________________________________________________________________
up_sampling1d_93 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_127[0][0]       
__________________________________________________________________________________________________
up_sampling1d_100 (UpSampling1D (None, 188, 64)      0           separable_conv1d_134[0][0]       
__________________________________________________________________________________________________
separable_conv1d_121 (Separable (None, 188, 64)      4480        up_sampling1d_86[0][0]           
__________________________________________________________________________________________________
separable_conv1d_128 (Separable (None, 188, 64)      4480        up_sampling1d_93[0][0]           
__________________________________________________________________________________________________
separable_conv1d_135 (Separable (None, 188, 64)      4480        up_sampling1d_100[0][0]          
__________________________________________________________________________________________________
up_sampling1d_87 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_121[0][0]       
__________________________________________________________________________________________________
up_sampling1d_94 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_128[0][0]       
__________________________________________________________________________________________________
up_sampling1d_101 (UpSampling1D (None, 376, 64)      0           separable_conv1d_135[0][0]       
__________________________________________________________________________________________________
separable_conv1d_122 (Separable (None, 376, 32)      2400        up_sampling1d_87[0][0]           
__________________________________________________________________________________________________
separable_conv1d_129 (Separable (None, 376, 32)      2400        up_sampling1d_94[0][0]           
__________________________________________________________________________________________________
separable_conv1d_136 (Separable (None, 376, 32)      2400        up_sampling1d_101[0][0]          
__________________________________________________________________________________________________
up_sampling1d_88 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_122[0][0]       
__________________________________________________________________________________________________
up_sampling1d_95 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_129[0][0]       
__________________________________________________________________________________________________
up_sampling1d_102 (UpSampling1D (None, 752, 32)      0           separable_conv1d_136[0][0]       
__________________________________________________________________________________________________
cropping1d_13 (Cropping1D)      (None, 750, 32)      0           up_sampling1d_88[0][0]           
__________________________________________________________________________________________________
cropping1d_14 (Cropping1D)      (None, 750, 32)      0           up_sampling1d_95[0][0]           
__________________________________________________________________________________________________
cropping1d_15 (Cropping1D)      (None, 750, 32)      0           up_sampling1d_102[0][0]          
__________________________________________________________________________________________________
separable_conv1d_123 (Separable (None, 750, 32)      1280        cropping1d_13[0][0]              
__________________________________________________________________________________________________
separable_conv1d_130 (Separable (None, 750, 32)      1280        cropping1d_14[0][0]              
__________________________________________________________________________________________________
separable_conv1d_137 (Separable (None, 750, 32)      1280        cropping1d_15[0][0]              
__________________________________________________________________________________________________
up_sampling1d_89 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_123[0][0]       
__________________________________________________________________________________________________
up_sampling1d_96 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_130[0][0]       
__________________________________________________________________________________________________
up_sampling1d_103 (UpSampling1D (None, 1500, 32)     0           separable_conv1d_137[0][0]       
__________________________________________________________________________________________________
separable_conv1d_124 (Separable (None, 1500, 16)     752         up_sampling1d_89[0][0]           
__________________________________________________________________________________________________
separable_conv1d_131 (Separable (None, 1500, 16)     752         up_sampling1d_96[0][0]           
__________________________________________________________________________________________________
separable_conv1d_138 (Separable (None, 1500, 16)     752         up_sampling1d_103[0][0]          
__________________________________________________________________________________________________
up_sampling1d_90 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_124[0][0]       
__________________________________________________________________________________________________
up_sampling1d_97 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_131[0][0]       
__________________________________________________________________________________________________
up_sampling1d_104 (UpSampling1D (None, 3000, 16)     0           separable_conv1d_138[0][0]       
__________________________________________________________________________________________________
separable_conv1d_125 (Separable (None, 3000, 16)     416         up_sampling1d_90[0][0]           
__________________________________________________________________________________________________
separable_conv1d_132 (Separable (None, 3000, 16)     416         up_sampling1d_97[0][0]           
__________________________________________________________________________________________________
separable_conv1d_139 (Separable (None, 3000, 16)     416         up_sampling1d_104[0][0]          
__________________________________________________________________________________________________
up_sampling1d_91 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_125[0][0]       
__________________________________________________________________________________________________
up_sampling1d_98 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_132[0][0]       
__________________________________________________________________________________________________
up_sampling1d_105 (UpSampling1D (None, 6000, 16)     0           separable_conv1d_139[0][0]       
__________________________________________________________________________________________________
separable_conv1d_126 (Separable (None, 6000, 8)      312         up_sampling1d_91[0][0]           
__________________________________________________________________________________________________
separable_conv1d_133 (Separable (None, 6000, 8)      312         up_sampling1d_98[0][0]           
__________________________________________________________________________________________________
separable_conv1d_140 (Separable (None, 6000, 8)      312         up_sampling1d_105[0][0]          
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          separable_conv1d_126[0][0]       
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          separable_conv1d_133[0][0]       
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          separable_conv1d_140[0][0]       
==================================================================================================
Total params: 90,688
Trainable params: 89,664
Non-trainable params: 1,024
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 4304s 717ms/step - loss: 0.0151 - detector_loss: 0.0614 - picker_P_loss: 0.0132 - picker_S_loss: 0.0115 - detector_f1: 0.8009 - picker_P_f1: 0.0861 - picker_S_f1: 0.0475 - val_loss: 0.0044 - val_detector_loss: 0.0239 - val_picker_P_loss: 0.0040 - val_picker_S_loss: 0.0041 - val_detector_f1: 0.9178 - val_picker_P_f1: 0.3769 - val_picker_S_f1: 0.2553

Epoch 00001: val_loss improved from inf to 0.00440, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 4298s 716ms/step - loss: 0.0070 - detector_loss: 0.0316 - picker_P_loss: 0.0055 - picker_S_loss: 0.0055 - detector_f1: 0.9021 - picker_P_f1: 0.3192 - picker_S_f1: 0.2121 - val_loss: 0.0030 - val_detector_loss: 0.0136 - val_picker_P_loss: 0.0028 - val_picker_S_loss: 0.0038 - val_detector_f1: 0.9546 - val_picker_P_f1: 0.5660 - val_picker_S_f1: 0.3191

Epoch 00002: val_loss improved from 0.00440 to 0.00299, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_002.h5
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 4043s 674ms/step - loss: 0.0063 - detector_loss: 0.0270 - picker_P_loss: 0.0049 - picker_S_loss: 0.0052 - detector_f1: 0.9168 - picker_P_f1: 0.4143 - picker_S_f1: 0.2866 - val_loss: 0.0028 - val_detector_loss: 0.0106 - val_picker_P_loss: 0.0023 - val_picker_S_loss: 0.0035 - val_detector_f1: 0.9657 - val_picker_P_f1: 0.6777 - val_picker_S_f1: 0.3894

Epoch 00003: val_loss improved from 0.00299 to 0.00284, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_003.h5
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 6186s 1s/step - loss: 0.0058 - detector_loss: 0.0238 - picker_P_loss: 0.0046 - picker_S_loss: 0.0049 - detector_f1: 0.9272 - picker_P_f1: 0.4641 - picker_S_f1: 0.3315 - val_loss: 0.0028 - val_detector_loss: 0.0120 - val_picker_P_loss: 0.0022 - val_picker_S_loss: 0.0035 - val_detector_f1: 0.9567 - val_picker_P_f1: 0.6829 - val_picker_S_f1: 0.4534

Epoch 00004: val_loss improved from 0.00284 to 0.00279, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_004.h5
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 5706s 951ms/step - loss: 0.0056 - detector_loss: 0.0224 - picker_P_loss: 0.0044 - picker_S_loss: 0.0048 - detector_f1: 0.9320 - picker_P_f1: 0.4929 - picker_S_f1: 0.3531 - val_loss: 0.0024 - val_detector_loss: 0.0083 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9715 - val_picker_P_f1: 0.6962 - val_picker_S_f1: 0.4522

Epoch 00005: val_loss improved from 0.00279 to 0.00245, saving model to C:\Users\Revlist\Documents\BusanUniv\EQTransformer159\test_trainer_outputs\models\test_trainer_005.h5
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 3599s 600ms/step - loss: 0.0054 - detector_loss: 0.0210 - picker_P_loss: 0.0042 - picker_S_loss: 0.0047 - detector_f1: 0.9345 - picker_P_f1: 0.5082 - picker_S_f1: 0.3714 - val_loss: 0.0025 - val_detector_loss: 0.0081 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0035 - val_detector_f1: 0.9733 - val_picker_P_f1: 0.6905 - val_picker_S_f1: 0.4573

Epoch 00006: val_loss did not improve from 0.00245
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 3230s 538ms/step - loss: 0.0053 - detector_loss: 0.0199 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9385 - picker_P_f1: 0.5226 - picker_S_f1: 0.3862 - val_loss: 0.0026 - val_detector_loss: 0.0092 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9705 - val_picker_P_f1: 0.6911 - val_picker_S_f1: 0.4469

Epoch 00007: val_loss did not improve from 0.00245
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 3235s 539ms/step - loss: 0.0052 - detector_loss: 0.0194 - picker_P_loss: 0.0040 - picker_S_loss: 0.0045 - detector_f1: 0.9386 - picker_P_f1: 0.5309 - picker_S_f1: 0.3963 - val_loss: 0.0028 - val_detector_loss: 0.0093 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9700 - val_picker_P_f1: 0.6936 - val_picker_S_f1: 0.4875

Epoch 00008: val_loss did not improve from 0.00245
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 3353s 559ms/step - loss: 0.0051 - detector_loss: 0.0188 - picker_P_loss: 0.0039 - picker_S_loss: 0.0045 - detector_f1: 0.9423 - picker_P_f1: 0.5422 - picker_S_f1: 0.4026 - val_loss: 0.0027 - val_detector_loss: 0.0069 - val_picker_P_loss: 0.0019 - val_picker_S_loss: 0.0031 - val_detector_f1: 0.9775 - val_picker_P_f1: 0.6883 - val_picker_S_f1: 0.4935

Epoch 00009: val_loss did not improve from 0.00245
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 3350s 558ms/step - loss: 0.0050 - detector_loss: 0.0184 - picker_P_loss: 0.0039 - picker_S_loss: 0.0045 - detector_f1: 0.9426 - picker_P_f1: 0.5476 - picker_S_f1: 0.4056 - val_loss: 0.0027 - val_detector_loss: 0.0065 - val_picker_P_loss: 0.0019 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9774 - val_picker_P_f1: 0.6931 - val_picker_S_f1: 0.4407

Epoch 00010: val_loss did not improve from 0.00245