Learning rate:  0.001
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
separable_conv1d_1 (SeparableCo (None, 6000, 8)      65          input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3000, 8)      0           separable_conv1d_1[0][0]         
__________________________________________________________________________________________________
separable_conv1d_2 (SeparableCo (None, 3000, 16)     216         max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 1500, 16)     0           separable_conv1d_2[0][0]         
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 3000, 3)      0           input[0][0]                      
__________________________________________________________________________________________________
separable_conv1d_3 (SeparableCo (None, 1500, 16)     384         max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 1500, 3)      0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 750, 16)      0           separable_conv1d_3[0][0]         
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 750, 3)       0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
separable_conv1d_4 (SeparableCo (None, 750, 32)      656         max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 750, 32)      704         max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
add_1 (Add)                     (None, 750, 32)      0           separable_conv1d_4[0][0]         
                                                                 conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 375, 32)      0           add_1[0][0]                      
__________________________________________________________________________________________________
separable_conv1d_5 (SeparableCo (None, 375, 32)      1216        max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 188, 32)      0           separable_conv1d_5[0][0]         
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 375, 32)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_6 (SeparableCo (None, 188, 64)      2272        max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 188, 32)      0           max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, 94, 64)       0           separable_conv1d_6[0][0]         
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, 94, 32)       0           max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
separable_conv1d_7 (SeparableCo (None, 94, 64)       4352        max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 94, 64)       6208        max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, 94, 64)       0           separable_conv1d_7[0][0]         
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_13 (MaxPooling1D) (None, 47, 64)       0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 47, 64)       256         max_pooling1d_13[0][0]           
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 47, 64)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 47, 16)       1040        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 47, 16)       64          conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 47, 16)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 47, 16)       0           activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 47, 16)       784         spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 47, 16)       64          conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 47, 16)       0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 47, 64)       1088        activation_3[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 47, 64)       0           max_pooling1d_13[0][0]           
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 47, 64)       256         add_3[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 47, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 47, 16)       1040        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 47, 16)       64          conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 47, 16)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 47, 16)       0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 47, 16)       784         spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 47, 16)       64          conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 47, 16)       0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 47, 64)       1088        activation_6[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 47, 64)       0           add_3[0][0]                      
                                                                 conv1d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 47, 64)       256         add_4[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 47, 64)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 47, 16)       1040        activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 47, 16)       64          conv1d_9[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 47, 16)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 47, 16)       0           activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 47, 16)       784         spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 47, 16)       64          conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 47, 16)       0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 47, 64)       1088        activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, 47, 64)       0           add_4[0][0]                      
                                                                 conv1d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 47, 64)       256         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 47, 64)       0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 47, 16)       1040        activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 47, 16)       64          conv1d_12[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 47, 16)       0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 47, 16)       0           activation_11[0][0]              
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 47, 16)       528         spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 47, 16)       64          conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 47, 16)       0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 47, 64)       1088        activation_12[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 47, 64)       0           add_5[0][0]                      
                                                                 conv1d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 47, 64)       256         add_6[0][0]                      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 47, 64)       0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 47, 16)       1040        activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 47, 16)       64          conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 47, 16)       0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 47, 16)       0           activation_14[0][0]              
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 47, 16)       528         spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 47, 16)       64          conv1d_16[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 47, 16)       0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 47, 64)       1088        activation_15[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 47, 64)       0           add_6[0][0]                      
                                                                 conv1d_17[0][0]                  
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 47, 32)       10368       add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 47, 16)       528         bidirectional_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 47, 16)       64          conv1d_18[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 47, 32)       4224        batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 47, 16)       528         bidirectional_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 47, 16)       64          conv1d_19[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 47, 16), (No 1089        batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, 47, 16)       0           batch_normalization_17[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 47, 16)       32          add_8[0][0]                      
__________________________________________________________________________________________________
feed_forward_1 (FeedForward)    (None, 47, 16)       4240        layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 47, 16)       0           layer_normalization_1[0][0]      
                                                                 feed_forward_1[0][0]             
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 47, 16)       32          add_9[0][0]                      
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 47, 16), (No 1089        layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 47, 16)       0           layer_normalization_2[0][0]      
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 47, 16)       32          add_10[0][0]                     
__________________________________________________________________________________________________
feed_forward_2 (FeedForward)    (None, 47, 16)       4240        layer_normalization_3[0][0]      
__________________________________________________________________________________________________
add_11 (Add)                    (None, 47, 16)       0           layer_normalization_3[0][0]      
                                                                 feed_forward_2[0][0]             
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 47, 16)       32          add_11[0][0]                     
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_3[0][0]                     
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_4[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_1 (UpSampling1D)  (None, 94, 16)       0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
up_sampling1d_8 (UpSampling1D)  (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_15 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_8 (SeparableCo (None, 94, 64)       1136        up_sampling1d_1[0][0]            
__________________________________________________________________________________________________
separable_conv1d_15 (SeparableC (None, 94, 64)       1136        up_sampling1d_8[0][0]            
__________________________________________________________________________________________________
separable_conv1d_22 (SeparableC (None, 94, 64)       1136        up_sampling1d_15[0][0]           
__________________________________________________________________________________________________
up_sampling1d_2 (UpSampling1D)  (None, 188, 64)      0           separable_conv1d_8[0][0]         
__________________________________________________________________________________________________
up_sampling1d_9 (UpSampling1D)  (None, 188, 64)      0           separable_conv1d_15[0][0]        
__________________________________________________________________________________________________
up_sampling1d_16 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_22[0][0]        
__________________________________________________________________________________________________
separable_conv1d_9 (SeparableCo (None, 188, 64)      4480        up_sampling1d_2[0][0]            
__________________________________________________________________________________________________
separable_conv1d_16 (SeparableC (None, 188, 64)      4480        up_sampling1d_9[0][0]            
__________________________________________________________________________________________________
separable_conv1d_23 (SeparableC (None, 188, 64)      4480        up_sampling1d_16[0][0]           
__________________________________________________________________________________________________
up_sampling1d_3 (UpSampling1D)  (None, 376, 64)      0           separable_conv1d_9[0][0]         
__________________________________________________________________________________________________
up_sampling1d_10 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_16[0][0]        
__________________________________________________________________________________________________
up_sampling1d_17 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_23[0][0]        
__________________________________________________________________________________________________
separable_conv1d_10 (SeparableC (None, 376, 32)      2400        up_sampling1d_3[0][0]            
__________________________________________________________________________________________________
separable_conv1d_17 (SeparableC (None, 376, 32)      2400        up_sampling1d_10[0][0]           
__________________________________________________________________________________________________
separable_conv1d_24 (SeparableC (None, 376, 32)      2400        up_sampling1d_17[0][0]           
__________________________________________________________________________________________________
up_sampling1d_4 (UpSampling1D)  (None, 752, 32)      0           separable_conv1d_10[0][0]        
__________________________________________________________________________________________________
up_sampling1d_11 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_17[0][0]        
__________________________________________________________________________________________________
up_sampling1d_18 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_24[0][0]        
__________________________________________________________________________________________________
cropping1d_1 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_4[0][0]            
__________________________________________________________________________________________________
cropping1d_2 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_11[0][0]           
__________________________________________________________________________________________________
cropping1d_3 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_18[0][0]           
__________________________________________________________________________________________________
separable_conv1d_11 (SeparableC (None, 750, 32)      1280        cropping1d_1[0][0]               
__________________________________________________________________________________________________
separable_conv1d_18 (SeparableC (None, 750, 32)      1280        cropping1d_2[0][0]               
__________________________________________________________________________________________________
separable_conv1d_25 (SeparableC (None, 750, 32)      1280        cropping1d_3[0][0]               
__________________________________________________________________________________________________
up_sampling1d_5 (UpSampling1D)  (None, 1500, 32)     0           separable_conv1d_11[0][0]        
__________________________________________________________________________________________________
up_sampling1d_12 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_18[0][0]        
__________________________________________________________________________________________________
up_sampling1d_19 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_25[0][0]        
__________________________________________________________________________________________________
separable_conv1d_12 (SeparableC (None, 1500, 16)     752         up_sampling1d_5[0][0]            
__________________________________________________________________________________________________
separable_conv1d_19 (SeparableC (None, 1500, 16)     752         up_sampling1d_12[0][0]           
__________________________________________________________________________________________________
separable_conv1d_26 (SeparableC (None, 1500, 16)     752         up_sampling1d_19[0][0]           
__________________________________________________________________________________________________
up_sampling1d_6 (UpSampling1D)  (None, 3000, 16)     0           separable_conv1d_12[0][0]        
__________________________________________________________________________________________________
up_sampling1d_13 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_19[0][0]        
__________________________________________________________________________________________________
up_sampling1d_20 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_26[0][0]        
__________________________________________________________________________________________________
separable_conv1d_13 (SeparableC (None, 3000, 16)     416         up_sampling1d_6[0][0]            
__________________________________________________________________________________________________
separable_conv1d_20 (SeparableC (None, 3000, 16)     416         up_sampling1d_13[0][0]           
__________________________________________________________________________________________________
separable_conv1d_27 (SeparableC (None, 3000, 16)     416         up_sampling1d_20[0][0]           
__________________________________________________________________________________________________
up_sampling1d_7 (UpSampling1D)  (None, 6000, 16)     0           separable_conv1d_13[0][0]        
__________________________________________________________________________________________________
up_sampling1d_14 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_20[0][0]        
__________________________________________________________________________________________________
up_sampling1d_21 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_27[0][0]        
__________________________________________________________________________________________________
separable_conv1d_14 (SeparableC (None, 6000, 8)      312         up_sampling1d_7[0][0]            
__________________________________________________________________________________________________
separable_conv1d_21 (SeparableC (None, 6000, 8)      312         up_sampling1d_14[0][0]           
__________________________________________________________________________________________________
separable_conv1d_28 (SeparableC (None, 6000, 8)      312         up_sampling1d_21[0][0]           
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          separable_conv1d_14[0][0]        
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          separable_conv1d_21[0][0]        
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          separable_conv1d_28[0][0]        
==================================================================================================
Total params: 97,600
Trainable params: 96,576
Non-trainable params: 1,024
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 3069s 512ms/step - loss: 0.0146 - detector_loss: 0.0603 - picker_P_loss: 0.0125 - picker_S_loss: 0.0114 - detector_f1: 0.8037 - picker_P_f1: 0.1206 - picker_S_f1: 0.0391 - val_loss: 0.0064 - val_detector_loss: 0.0146 - val_picker_P_loss: 0.0032 - val_picker_S_loss: 0.0043 - val_detector_f1: 0.9491 - val_picker_P_f1: 0.4727 - val_picker_S_f1: 0.1702

Epoch 00001: val_loss improved from inf to 0.00639, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 2934s 489ms/step - loss: 0.0065 - detector_loss: 0.0285 - picker_P_loss: 0.0051 - picker_S_loss: 0.0053 - detector_f1: 0.9114 - picker_P_f1: 0.3850 - picker_S_f1: 0.2363 - val_loss: 0.0055 - val_detector_loss: 0.0096 - val_picker_P_loss: 0.0028 - val_picker_S_loss: 0.0036 - val_detector_f1: 0.9668 - val_picker_P_f1: 0.5696 - val_picker_S_f1: 0.3338

Epoch 00002: val_loss improved from 0.00639 to 0.00554, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_002.h5
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 2915s 486ms/step - loss: 0.0059 - detector_loss: 0.0236 - picker_P_loss: 0.0046 - picker_S_loss: 0.0050 - detector_f1: 0.9253 - picker_P_f1: 0.4549 - picker_S_f1: 0.3081 - val_loss: 0.0053 - val_detector_loss: 0.0153 - val_picker_P_loss: 0.0025 - val_picker_S_loss: 0.0037 - val_detector_f1: 0.9596 - val_picker_P_f1: 0.6038 - val_picker_S_f1: 0.3526

Epoch 00003: val_loss improved from 0.00554 to 0.00527, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_003.h5
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 3022s 504ms/step - loss: 0.0056 - detector_loss: 0.0220 - picker_P_loss: 0.0045 - picker_S_loss: 0.0048 - detector_f1: 0.9314 - picker_P_f1: 0.4782 - picker_S_f1: 0.3375 - val_loss: 0.0042 - val_detector_loss: 0.0087 - val_picker_P_loss: 0.0023 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9705 - val_picker_P_f1: 0.6532 - val_picker_S_f1: 0.4206

Epoch 00004: val_loss improved from 0.00527 to 0.00418, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_004.h5
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 2986s 498ms/step - loss: 0.0054 - detector_loss: 0.0205 - picker_P_loss: 0.0043 - picker_S_loss: 0.0047 - detector_f1: 0.9367 - picker_P_f1: 0.4938 - picker_S_f1: 0.3621 - val_loss: 0.0045 - val_detector_loss: 0.0089 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9698 - val_picker_P_f1: 0.6692 - val_picker_S_f1: 0.4156

Epoch 00005: val_loss did not improve from 0.00418
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 2866s 478ms/step - loss: 0.0053 - detector_loss: 0.0196 - picker_P_loss: 0.0042 - picker_S_loss: 0.0047 - detector_f1: 0.9393 - picker_P_f1: 0.5090 - picker_S_f1: 0.3710 - val_loss: 0.0054 - val_detector_loss: 0.0142 - val_picker_P_loss: 0.0022 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9625 - val_picker_P_f1: 0.6669 - val_picker_S_f1: 0.4542

Epoch 00006: val_loss did not improve from 0.00418
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 2773s 462ms/step - loss: 0.0052 - detector_loss: 0.0187 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9423 - picker_P_f1: 0.5176 - picker_S_f1: 0.3826 - val_loss: 0.0043 - val_detector_loss: 0.0069 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9768 - val_picker_P_f1: 0.6645 - val_picker_S_f1: 0.4917

Epoch 00007: val_loss did not improve from 0.00418
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 2813s 469ms/step - loss: 0.0051 - detector_loss: 0.0186 - picker_P_loss: 0.0041 - picker_S_loss: 0.0045 - detector_f1: 0.9423 - picker_P_f1: 0.5211 - picker_S_f1: 0.3907 - val_loss: 0.0043 - val_detector_loss: 0.0069 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9765 - val_picker_P_f1: 0.6684 - val_picker_S_f1: 0.4451

Epoch 00008: val_loss did not improve from 0.00418
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 2908s 485ms/step - loss: 0.0050 - detector_loss: 0.0178 - picker_P_loss: 0.0040 - picker_S_loss: 0.0045 - detector_f1: 0.9447 - picker_P_f1: 0.5301 - picker_S_f1: 0.3972 - val_loss: 0.0041 - val_detector_loss: 0.0075 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0031 - val_detector_f1: 0.9769 - val_picker_P_f1: 0.6803 - val_picker_S_f1: 0.4623

Epoch 00009: val_loss improved from 0.00418 to 0.00412, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_009.h5
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 2788s 465ms/step - loss: 0.0049 - detector_loss: 0.0173 - picker_P_loss: 0.0039 - picker_S_loss: 0.0044 - detector_f1: 0.9457 - picker_P_f1: 0.5333 - picker_S_f1: 0.4067 - val_loss: 0.0042 - val_detector_loss: 0.0072 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9765 - val_picker_P_f1: 0.6639 - val_picker_S_f1: 0.4709

Epoch 00010: val_loss did not improve from 0.00412
