Learning rate:  0.001
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 6000, 8)      272         input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3000, 8)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 3000, 16)     1168        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1500, 16)     0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 1500, 16)     1808        max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 750, 16)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 750, 32)      3616        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 375, 32)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 375, 32)      5152        max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 188, 32)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 188, 64)      10304       max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 94, 64)       0           conv1d_6[0][0]                   
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 94, 64)       12352       max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 47, 64)       0           conv1d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 47, 64)       256         max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 47, 64)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 47, 64)       0           activation_1[0][0]               
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 47, 64)       256         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 47, 64)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 47, 64)       0           activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 47, 64)       0           max_pooling1d_7[0][0]            
                                                                 conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 47, 64)       256         add_1[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 47, 64)       0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 47, 64)       0           activation_3[0][0]               
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 47, 64)       256         conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 47, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 47, 64)       0           activation_4[0][0]               
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
add_2 (Add)                     (None, 47, 64)       0           add_1[0][0]                      
                                                                 conv1d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 47, 64)       256         add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 47, 64)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 47, 64)       0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 47, 64)       256         conv1d_12[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 47, 64)       0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 47, 64)       0           activation_6[0][0]               
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
add_3 (Add)                     (None, 47, 64)       0           add_2[0][0]                      
                                                                 conv1d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 47, 64)       256         add_3[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 47, 64)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 47, 64)       0           activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 47, 64)       256         conv1d_14[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 47, 64)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 47, 64)       0           activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
add_4 (Add)                     (None, 47, 64)       0           add_3[0][0]                      
                                                                 conv1d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 47, 64)       256         add_4[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 47, 64)       0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 47, 64)       0           activation_9[0][0]               
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 47, 64)       256         conv1d_16[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 47, 64)       0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 47, 64)       0           activation_10[0][0]              
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
add_5 (Add)                     (None, 47, 64)       0           add_4[0][0]                      
                                                                 conv1d_17[0][0]                  
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 47, 32)       10368       add_5[0][0]                      
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 47, 16)       528         bidirectional_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 47, 16)       64          conv1d_18[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 47, 32)       4224        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 47, 16)       528         bidirectional_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 47, 16)       64          conv1d_19[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 47, 16), (No 1089        batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, 47, 16)       0           batch_normalization_12[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 47, 16)       32          add_6[0][0]                      
__________________________________________________________________________________________________
feed_forward_1 (FeedForward)    (None, 47, 16)       4240        layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 47, 16)       0           layer_normalization_1[0][0]      
                                                                 feed_forward_1[0][0]             
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 47, 16)       32          add_7[0][0]                      
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 47, 16), (No 1089        layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 47, 16)       0           layer_normalization_2[0][0]      
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 47, 16)       32          add_8[0][0]                      
__________________________________________________________________________________________________
feed_forward_2 (FeedForward)    (None, 47, 16)       4240        layer_normalization_3[0][0]      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 47, 16)       0           layer_normalization_3[0][0]      
                                                                 feed_forward_2[0][0]             
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 47, 16)       32          add_9[0][0]                      
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_3[0][0]                     
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_4[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_1 (UpSampling1D)  (None, 94, 16)       0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
up_sampling1d_8 (UpSampling1D)  (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_15 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 94, 64)       3136        up_sampling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 94, 64)       3136        up_sampling1d_8[0][0]            
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, 94, 64)       3136        up_sampling1d_15[0][0]           
__________________________________________________________________________________________________
up_sampling1d_2 (UpSampling1D)  (None, 188, 64)      0           conv1d_20[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_9 (UpSampling1D)  (None, 188, 64)      0           conv1d_27[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_16 (UpSampling1D) (None, 188, 64)      0           conv1d_34[0][0]                  
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 188, 64)      20544       up_sampling1d_2[0][0]            
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 188, 64)      20544       up_sampling1d_9[0][0]            
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, 188, 64)      20544       up_sampling1d_16[0][0]           
__________________________________________________________________________________________________
up_sampling1d_3 (UpSampling1D)  (None, 376, 64)      0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_10 (UpSampling1D) (None, 376, 64)      0           conv1d_28[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_17 (UpSampling1D) (None, 376, 64)      0           conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, 376, 32)      10272       up_sampling1d_3[0][0]            
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 376, 32)      10272       up_sampling1d_10[0][0]           
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, 376, 32)      10272       up_sampling1d_17[0][0]           
__________________________________________________________________________________________________
up_sampling1d_4 (UpSampling1D)  (None, 752, 32)      0           conv1d_22[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_11 (UpSampling1D) (None, 752, 32)      0           conv1d_29[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_18 (UpSampling1D) (None, 752, 32)      0           conv1d_36[0][0]                  
__________________________________________________________________________________________________
cropping1d_1 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_4[0][0]            
__________________________________________________________________________________________________
cropping1d_2 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_11[0][0]           
__________________________________________________________________________________________________
cropping1d_3 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_18[0][0]           
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 750, 32)      7200        cropping1d_1[0][0]               
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 750, 32)      7200        cropping1d_2[0][0]               
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, 750, 32)      7200        cropping1d_3[0][0]               
__________________________________________________________________________________________________
up_sampling1d_5 (UpSampling1D)  (None, 1500, 32)     0           conv1d_23[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_12 (UpSampling1D) (None, 1500, 32)     0           conv1d_30[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_19 (UpSampling1D) (None, 1500, 32)     0           conv1d_37[0][0]                  
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 1500, 16)     3600        up_sampling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 1500, 16)     3600        up_sampling1d_12[0][0]           
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, 1500, 16)     3600        up_sampling1d_19[0][0]           
__________________________________________________________________________________________________
up_sampling1d_6 (UpSampling1D)  (None, 3000, 16)     0           conv1d_24[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_13 (UpSampling1D) (None, 3000, 16)     0           conv1d_31[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_20 (UpSampling1D) (None, 3000, 16)     0           conv1d_38[0][0]                  
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 3000, 16)     2320        up_sampling1d_6[0][0]            
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, 3000, 16)     2320        up_sampling1d_13[0][0]           
__________________________________________________________________________________________________
conv1d_39 (Conv1D)              (None, 3000, 16)     2320        up_sampling1d_20[0][0]           
__________________________________________________________________________________________________
up_sampling1d_7 (UpSampling1D)  (None, 6000, 16)     0           conv1d_25[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_14 (UpSampling1D) (None, 6000, 16)     0           conv1d_32[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_21 (UpSampling1D) (None, 6000, 16)     0           conv1d_39[0][0]                  
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 6000, 8)      1416        up_sampling1d_7[0][0]            
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, 6000, 8)      1416        up_sampling1d_14[0][0]           
__________________________________________________________________________________________________
conv1d_40 (Conv1D)              (None, 6000, 8)      1416        up_sampling1d_21[0][0]           
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          conv1d_26[0][0]                  
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          conv1d_33[0][0]                  
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          conv1d_40[0][0]                  
==================================================================================================
Total params: 323,063
Trainable params: 321,719
Non-trainable params: 1,344
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 3507s 585ms/step - loss: 0.0135 - detector_loss: 0.0665 - picker_P_loss: 0.0101 - picker_S_loss: 0.0100 - detector_f1: 0.8493 - picker_P_f1: 0.2011 - picker_S_f1: 0.1407 - val_loss: 0.0056 - val_detector_loss: 0.0150 - val_picker_P_loss: 0.0042 - val_picker_S_loss: 0.0052 - val_detector_f1: 0.9652 - val_picker_P_f1: 0.5250 - val_picker_S_f1: 0.2609

Epoch 00001: val_loss improved from inf to 0.00565, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 4024s 671ms/step - loss: 0.0087 - detector_loss: 0.0365 - picker_P_loss: 0.0067 - picker_S_loss: 0.0069 - detector_f1: 0.9229 - picker_P_f1: 0.4557 - picker_S_f1: 0.3375 - val_loss: 0.0047 - val_detector_loss: 0.0128 - val_picker_P_loss: 0.0034 - val_picker_S_loss: 0.0047 - val_detector_f1: 0.9695 - val_picker_P_f1: 0.6318 - val_picker_S_f1: 0.4392

Epoch 00002: val_loss improved from 0.00565 to 0.00467, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_002.h5
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 3931s 655ms/step - loss: 0.0080 - detector_loss: 0.0322 - picker_P_loss: 0.0062 - picker_S_loss: 0.0064 - detector_f1: 0.9322 - picker_P_f1: 0.4977 - picker_S_f1: 0.3921 - val_loss: 0.0047 - val_detector_loss: 0.0161 - val_picker_P_loss: 0.0034 - val_picker_S_loss: 0.0047 - val_detector_f1: 0.9632 - val_picker_P_f1: 0.6483 - val_picker_S_f1: 0.4714

Epoch 00003: val_loss improved from 0.00467 to 0.00466, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_003.h5
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 3696s 616ms/step - loss: 0.0076 - detector_loss: 0.0291 - picker_P_loss: 0.0059 - picker_S_loss: 0.0062 - detector_f1: 0.9390 - picker_P_f1: 0.5219 - picker_S_f1: 0.4177 - val_loss: 0.0049 - val_detector_loss: 0.0110 - val_picker_P_loss: 0.0030 - val_picker_S_loss: 0.0045 - val_detector_f1: 0.9732 - val_picker_P_f1: 0.6735 - val_picker_S_f1: 0.5194

Epoch 00004: val_loss did not improve from 0.00466
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 3634s 606ms/step - loss: 0.0074 - detector_loss: 0.0280 - picker_P_loss: 0.0058 - picker_S_loss: 0.0061 - detector_f1: 0.9406 - picker_P_f1: 0.5339 - picker_S_f1: 0.4309 - val_loss: 0.0049 - val_detector_loss: 0.0175 - val_picker_P_loss: 0.0030 - val_picker_S_loss: 0.0045 - val_detector_f1: 0.9729 - val_picker_P_f1: 0.6662 - val_picker_S_f1: 0.4710

Epoch 00005: val_loss did not improve from 0.00466
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 3635s 606ms/step - loss: 0.0072 - detector_loss: 0.0263 - picker_P_loss: 0.0056 - picker_S_loss: 0.0060 - detector_f1: 0.9446 - picker_P_f1: 0.5432 - picker_S_f1: 0.4430 - val_loss: 0.0043 - val_detector_loss: 0.0094 - val_picker_P_loss: 0.0028 - val_picker_S_loss: 0.0043 - val_detector_f1: 0.9755 - val_picker_P_f1: 0.6729 - val_picker_S_f1: 0.4942

Epoch 00006: val_loss improved from 0.00466 to 0.00430, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_006.h5
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 3679s 613ms/step - loss: 0.0071 - detector_loss: 0.0256 - picker_P_loss: 0.0055 - picker_S_loss: 0.0059 - detector_f1: 0.9457 - picker_P_f1: 0.5475 - picker_S_f1: 0.4458 - val_loss: 0.0039 - val_detector_loss: 0.0086 - val_picker_P_loss: 0.0028 - val_picker_S_loss: 0.0042 - val_detector_f1: 0.9795 - val_picker_P_f1: 0.6961 - val_picker_S_f1: 0.4842

Epoch 00007: val_loss improved from 0.00430 to 0.00391, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_007.h5
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 3720s 620ms/step - loss: 0.0070 - detector_loss: 0.0249 - picker_P_loss: 0.0055 - picker_S_loss: 0.0059 - detector_f1: 0.9472 - picker_P_f1: 0.5526 - picker_S_f1: 0.4495 - val_loss: 0.0047 - val_detector_loss: 0.0090 - val_picker_P_loss: 0.0027 - val_picker_S_loss: 0.0042 - val_detector_f1: 0.9794 - val_picker_P_f1: 0.7075 - val_picker_S_f1: 0.4915

Epoch 00008: val_loss did not improve from 0.00391
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 3730s 622ms/step - loss: 0.0069 - detector_loss: 0.0247 - picker_P_loss: 0.0054 - picker_S_loss: 0.0059 - detector_f1: 0.9477 - picker_P_f1: 0.5569 - picker_S_f1: 0.4545 - val_loss: 0.0041 - val_detector_loss: 0.0088 - val_picker_P_loss: 0.0027 - val_picker_S_loss: 0.0042 - val_detector_f1: 0.9779 - val_picker_P_f1: 0.7056 - val_picker_S_f1: 0.4866

Epoch 00009: val_loss did not improve from 0.00391
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 3761s 627ms/step - loss: 0.0068 - detector_loss: 0.0240 - picker_P_loss: 0.0053 - picker_S_loss: 0.0058 - detector_f1: 0.9493 - picker_P_f1: 0.5648 - picker_S_f1: 0.4601 - val_loss: 0.0041 - val_detector_loss: 0.0074 - val_picker_P_loss: 0.0027 - val_picker_S_loss: 0.0042 - val_detector_f1: 0.9812 - val_picker_P_f1: 0.7056 - val_picker_S_f1: 0.5152

Epoch 00010: val_loss did not improve from 0.00391
