Learning rate:  0.001
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
separable_conv1d_29 (SeparableC (None, 6000, 8)      65          input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_15 (MaxPooling1D) (None, 3000, 8)      0           separable_conv1d_29[0][0]        
__________________________________________________________________________________________________
separable_conv1d_30 (SeparableC (None, 3000, 16)     216         max_pooling1d_15[0][0]           
__________________________________________________________________________________________________
max_pooling1d_16 (MaxPooling1D) (None, 1500, 16)     0           separable_conv1d_30[0][0]        
__________________________________________________________________________________________________
separable_conv1d_31 (SeparableC (None, 1500, 16)     384         max_pooling1d_16[0][0]           
__________________________________________________________________________________________________
max_pooling1d_17 (MaxPooling1D) (None, 750, 16)      0           separable_conv1d_31[0][0]        
__________________________________________________________________________________________________
separable_conv1d_32 (SeparableC (None, 750, 32)      656         max_pooling1d_17[0][0]           
__________________________________________________________________________________________________
max_pooling1d_18 (MaxPooling1D) (None, 375, 32)      0           separable_conv1d_32[0][0]        
__________________________________________________________________________________________________
separable_conv1d_33 (SeparableC (None, 375, 32)      1216        max_pooling1d_18[0][0]           
__________________________________________________________________________________________________
max_pooling1d_19 (MaxPooling1D) (None, 188, 32)      0           separable_conv1d_33[0][0]        
__________________________________________________________________________________________________
separable_conv1d_34 (SeparableC (None, 188, 64)      2272        max_pooling1d_19[0][0]           
__________________________________________________________________________________________________
max_pooling1d_20 (MaxPooling1D) (None, 94, 64)       0           separable_conv1d_34[0][0]        
__________________________________________________________________________________________________
separable_conv1d_35 (SeparableC (None, 94, 64)       4352        max_pooling1d_20[0][0]           
__________________________________________________________________________________________________
max_pooling1d_21 (MaxPooling1D) (None, 47, 64)       0           separable_conv1d_35[0][0]        
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 47, 64)       256         max_pooling1d_21[0][0]           
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 47, 64)       0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 47, 64)       0           activation_19[0][0]              
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 47, 64)       256         conv1d_23[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 47, 64)       0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 47, 64)       0           activation_20[0][0]              
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
add_18 (Add)                    (None, 47, 64)       0           max_pooling1d_21[0][0]           
                                                                 conv1d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 47, 64)       256         add_18[0][0]                     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 47, 64)       0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 47, 64)       0           activation_21[0][0]              
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 47, 64)       256         conv1d_25[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 47, 64)       0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 47, 64)       0           activation_22[0][0]              
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
add_19 (Add)                    (None, 47, 64)       0           add_18[0][0]                     
                                                                 conv1d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 47, 64)       256         add_19[0][0]                     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 47, 64)       0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_23 (SpatialDr (None, 47, 64)       0           activation_23[0][0]              
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_23[0][0]       
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 47, 64)       256         conv1d_27[0][0]                  
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 47, 64)       0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_24 (SpatialDr (None, 47, 64)       0           activation_24[0][0]              
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, 47, 64)       12352       spatial_dropout1d_24[0][0]       
__________________________________________________________________________________________________
add_20 (Add)                    (None, 47, 64)       0           add_19[0][0]                     
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 47, 64)       256         add_20[0][0]                     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 47, 64)       0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_25 (SpatialDr (None, 47, 64)       0           activation_25[0][0]              
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_25[0][0]       
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 47, 64)       256         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 47, 64)       0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_26 (SpatialDr (None, 47, 64)       0           activation_26[0][0]              
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_26[0][0]       
__________________________________________________________________________________________________
add_21 (Add)                    (None, 47, 64)       0           add_20[0][0]                     
                                                                 conv1d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 47, 64)       256         add_21[0][0]                     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 47, 64)       0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_27 (SpatialDr (None, 47, 64)       0           activation_27[0][0]              
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_27[0][0]       
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 47, 64)       256         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 47, 64)       0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_28 (SpatialDr (None, 47, 64)       0           activation_28[0][0]              
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_28[0][0]       
__________________________________________________________________________________________________
add_22 (Add)                    (None, 47, 64)       0           add_21[0][0]                     
                                                                 conv1d_32[0][0]                  
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) (None, 47, 32)       10368       add_22[0][0]                     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, 47, 16)       528         bidirectional_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 47, 16)       64          conv1d_33[0][0]                  
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) (None, 47, 32)       4224        batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, 47, 16)       528         bidirectional_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 47, 16)       64          conv1d_34[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 47, 16), (No 1089        batch_normalization_34[0][0]     
__________________________________________________________________________________________________
add_23 (Add)                    (None, 47, 16)       0           batch_normalization_34[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_9 (LayerNor (None, 47, 16)       32          add_23[0][0]                     
__________________________________________________________________________________________________
feed_forward_5 (FeedForward)    (None, 47, 16)       4240        layer_normalization_9[0][0]      
__________________________________________________________________________________________________
add_24 (Add)                    (None, 47, 16)       0           layer_normalization_9[0][0]      
                                                                 feed_forward_5[0][0]             
__________________________________________________________________________________________________
layer_normalization_10 (LayerNo (None, 47, 16)       32          add_24[0][0]                     
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 47, 16), (No 1089        layer_normalization_10[0][0]     
__________________________________________________________________________________________________
add_25 (Add)                    (None, 47, 16)       0           layer_normalization_10[0][0]     
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_11 (LayerNo (None, 47, 16)       32          add_25[0][0]                     
__________________________________________________________________________________________________
feed_forward_6 (FeedForward)    (None, 47, 16)       4240        layer_normalization_11[0][0]     
__________________________________________________________________________________________________
add_26 (Add)                    (None, 47, 16)       0           layer_normalization_11[0][0]     
                                                                 feed_forward_6[0][0]             
__________________________________________________________________________________________________
layer_normalization_12 (LayerNo (None, 47, 16)       32          add_26[0][0]                     
__________________________________________________________________________________________________
lstm_7 (LSTM)                   (None, 47, 16)       2112        layer_normalization_12[0][0]     
__________________________________________________________________________________________________
lstm_8 (LSTM)                   (None, 47, 16)       2112        layer_normalization_12[0][0]     
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_7[0][0]                     
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_8[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_15 (UpSampling1D) (None, 94, 16)       0           layer_normalization_12[0][0]     
__________________________________________________________________________________________________
up_sampling1d_22 (UpSampling1D) (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_29 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_36 (SeparableC (None, 94, 64)       1136        up_sampling1d_15[0][0]           
__________________________________________________________________________________________________
separable_conv1d_43 (SeparableC (None, 94, 64)       1136        up_sampling1d_22[0][0]           
__________________________________________________________________________________________________
separable_conv1d_50 (SeparableC (None, 94, 64)       1136        up_sampling1d_29[0][0]           
__________________________________________________________________________________________________
up_sampling1d_16 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_36[0][0]        
__________________________________________________________________________________________________
up_sampling1d_23 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_43[0][0]        
__________________________________________________________________________________________________
up_sampling1d_30 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_50[0][0]        
__________________________________________________________________________________________________
separable_conv1d_37 (SeparableC (None, 188, 64)      4480        up_sampling1d_16[0][0]           
__________________________________________________________________________________________________
separable_conv1d_44 (SeparableC (None, 188, 64)      4480        up_sampling1d_23[0][0]           
__________________________________________________________________________________________________
separable_conv1d_51 (SeparableC (None, 188, 64)      4480        up_sampling1d_30[0][0]           
__________________________________________________________________________________________________
up_sampling1d_17 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_37[0][0]        
__________________________________________________________________________________________________
up_sampling1d_24 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_44[0][0]        
__________________________________________________________________________________________________
up_sampling1d_31 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_51[0][0]        
__________________________________________________________________________________________________
separable_conv1d_38 (SeparableC (None, 376, 32)      2400        up_sampling1d_17[0][0]           
__________________________________________________________________________________________________
separable_conv1d_45 (SeparableC (None, 376, 32)      2400        up_sampling1d_24[0][0]           
__________________________________________________________________________________________________
separable_conv1d_52 (SeparableC (None, 376, 32)      2400        up_sampling1d_31[0][0]           
__________________________________________________________________________________________________
up_sampling1d_18 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_38[0][0]        
__________________________________________________________________________________________________
up_sampling1d_25 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_45[0][0]        
__________________________________________________________________________________________________
up_sampling1d_32 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_52[0][0]        
__________________________________________________________________________________________________
cropping1d_3 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_18[0][0]           
__________________________________________________________________________________________________
cropping1d_4 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_25[0][0]           
__________________________________________________________________________________________________
cropping1d_5 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_32[0][0]           
__________________________________________________________________________________________________
separable_conv1d_39 (SeparableC (None, 750, 32)      1280        cropping1d_3[0][0]               
__________________________________________________________________________________________________
separable_conv1d_46 (SeparableC (None, 750, 32)      1280        cropping1d_4[0][0]               
__________________________________________________________________________________________________
separable_conv1d_53 (SeparableC (None, 750, 32)      1280        cropping1d_5[0][0]               
__________________________________________________________________________________________________
up_sampling1d_19 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_39[0][0]        
__________________________________________________________________________________________________
up_sampling1d_26 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_46[0][0]        
__________________________________________________________________________________________________
up_sampling1d_33 (UpSampling1D) (None, 1500, 32)     0           separable_conv1d_53[0][0]        
__________________________________________________________________________________________________
separable_conv1d_40 (SeparableC (None, 1500, 16)     752         up_sampling1d_19[0][0]           
__________________________________________________________________________________________________
separable_conv1d_47 (SeparableC (None, 1500, 16)     752         up_sampling1d_26[0][0]           
__________________________________________________________________________________________________
separable_conv1d_54 (SeparableC (None, 1500, 16)     752         up_sampling1d_33[0][0]           
__________________________________________________________________________________________________
up_sampling1d_20 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_40[0][0]        
__________________________________________________________________________________________________
up_sampling1d_27 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_47[0][0]        
__________________________________________________________________________________________________
up_sampling1d_34 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_54[0][0]        
__________________________________________________________________________________________________
separable_conv1d_41 (SeparableC (None, 3000, 16)     416         up_sampling1d_20[0][0]           
__________________________________________________________________________________________________
separable_conv1d_48 (SeparableC (None, 3000, 16)     416         up_sampling1d_27[0][0]           
__________________________________________________________________________________________________
separable_conv1d_55 (SeparableC (None, 3000, 16)     416         up_sampling1d_34[0][0]           
__________________________________________________________________________________________________
up_sampling1d_21 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_41[0][0]        
__________________________________________________________________________________________________
up_sampling1d_28 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_48[0][0]        
__________________________________________________________________________________________________
up_sampling1d_35 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_55[0][0]        
__________________________________________________________________________________________________
separable_conv1d_42 (SeparableC (None, 6000, 8)      312         up_sampling1d_21[0][0]           
__________________________________________________________________________________________________
separable_conv1d_49 (SeparableC (None, 6000, 8)      312         up_sampling1d_28[0][0]           
__________________________________________________________________________________________________
separable_conv1d_56 (SeparableC (None, 6000, 8)      312         up_sampling1d_35[0][0]           
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          separable_conv1d_42[0][0]        
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          separable_conv1d_49[0][0]        
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          separable_conv1d_56[0][0]        
==================================================================================================
Total params: 184,416
Trainable params: 183,072
Non-trainable params: 1,344
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 2966s 494ms/step - loss: 0.0157 - detector_loss: 0.0593 - picker_P_loss: 0.0121 - picker_S_loss: 0.0136 - detector_f1: 0.8099 - picker_P_f1: 0.1363 - picker_S_f1: 0.0239 - val_loss: 0.0042 - val_detector_loss: 0.0185 - val_picker_P_loss: 0.0033 - val_picker_S_loss: 0.0041 - val_detector_f1: 0.9391 - val_picker_P_f1: 0.4668 - val_picker_S_f1: 0.1842

Epoch 00001: val_loss improved from inf to 0.00420, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 2783s 464ms/step - loss: 0.0068 - detector_loss: 0.0304 - picker_P_loss: 0.0052 - picker_S_loss: 0.0055 - detector_f1: 0.9072 - picker_P_f1: 0.3778 - picker_S_f1: 0.1846 - val_loss: 0.0059 - val_detector_loss: 0.0948 - val_picker_P_loss: 0.0046 - val_picker_S_loss: 0.0057 - val_detector_f1: 0.7010 - val_picker_P_f1: 0.3961 - val_picker_S_f1: 0.1434

Epoch 00002: val_loss did not improve from 0.00420
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 2769s 461ms/step - loss: 0.0062 - detector_loss: 0.0259 - picker_P_loss: 0.0048 - picker_S_loss: 0.0052 - detector_f1: 0.9209 - picker_P_f1: 0.4364 - picker_S_f1: 0.2565 - val_loss: 0.0035 - val_detector_loss: 0.0133 - val_picker_P_loss: 0.0023 - val_picker_S_loss: 0.0036 - val_detector_f1: 0.9552 - val_picker_P_f1: 0.6440 - val_picker_S_f1: 0.3484

Epoch 00003: val_loss improved from 0.00420 to 0.00354, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_003.h5
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 2715s 452ms/step - loss: 0.0059 - detector_loss: 0.0241 - picker_P_loss: 0.0046 - picker_S_loss: 0.0050 - detector_f1: 0.9251 - picker_P_f1: 0.4640 - picker_S_f1: 0.2990 - val_loss: 0.0034 - val_detector_loss: 0.0089 - val_picker_P_loss: 0.0022 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9683 - val_picker_P_f1: 0.6816 - val_picker_S_f1: 0.4065

Epoch 00004: val_loss improved from 0.00354 to 0.00340, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_004.h5
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 2585s 431ms/step - loss: 0.0058 - detector_loss: 0.0234 - picker_P_loss: 0.0045 - picker_S_loss: 0.0049 - detector_f1: 0.9296 - picker_P_f1: 0.4819 - picker_S_f1: 0.3268 - val_loss: 0.0030 - val_detector_loss: 0.0085 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9698 - val_picker_P_f1: 0.6626 - val_picker_S_f1: 0.3811

Epoch 00005: val_loss improved from 0.00340 to 0.00297, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_005.h5
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 2608s 435ms/step - loss: 0.0056 - detector_loss: 0.0221 - picker_P_loss: 0.0043 - picker_S_loss: 0.0048 - detector_f1: 0.9333 - picker_P_f1: 0.4956 - picker_S_f1: 0.3446 - val_loss: 0.0028 - val_detector_loss: 0.0082 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9695 - val_picker_P_f1: 0.6660 - val_picker_S_f1: 0.3985

Epoch 00006: val_loss improved from 0.00297 to 0.00279, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_006.h5
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 2607s 434ms/step - loss: 0.0055 - detector_loss: 0.0211 - picker_P_loss: 0.0043 - picker_S_loss: 0.0047 - detector_f1: 0.9347 - picker_P_f1: 0.5039 - picker_S_f1: 0.3570 - val_loss: 0.0031 - val_detector_loss: 0.0080 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9741 - val_picker_P_f1: 0.6806 - val_picker_S_f1: 0.4488

Epoch 00007: val_loss did not improve from 0.00279
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 2588s 431ms/step - loss: 0.0054 - detector_loss: 0.0208 - picker_P_loss: 0.0042 - picker_S_loss: 0.0047 - detector_f1: 0.9372 - picker_P_f1: 0.5155 - picker_S_f1: 0.3729 - val_loss: 0.0026 - val_detector_loss: 0.0073 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9755 - val_picker_P_f1: 0.6814 - val_picker_S_f1: 0.4816

Epoch 00008: val_loss improved from 0.00279 to 0.00260, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_008.h5
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 2584s 431ms/step - loss: 0.0053 - detector_loss: 0.0198 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9397 - picker_P_f1: 0.5226 - picker_S_f1: 0.3754 - val_loss: 0.0025 - val_detector_loss: 0.0071 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9763 - val_picker_P_f1: 0.6800 - val_picker_S_f1: 0.4212

Epoch 00009: val_loss improved from 0.00260 to 0.00249, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_009.h5
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 2595s 432ms/step - loss: 0.0052 - detector_loss: 0.0197 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9407 - picker_P_f1: 0.5314 - picker_S_f1: 0.3875 - val_loss: 0.0027 - val_detector_loss: 0.0073 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9743 - val_picker_P_f1: 0.6782 - val_picker_S_f1: 0.4391

Epoch 00010: val_loss did not improve from 0.00249
