Learning rate:  0.001
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              (None, 6000, 3)      0                                            
__________________________________________________________________________________________________
separable_conv1d_1 (SeparableCo (None, 6000, 8)      65          input[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3000, 8)      0           separable_conv1d_1[0][0]         
__________________________________________________________________________________________________
separable_conv1d_2 (SeparableCo (None, 3000, 16)     216         max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 1500, 16)     0           separable_conv1d_2[0][0]         
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 3000, 3)      0           input[0][0]                      
__________________________________________________________________________________________________
separable_conv1d_3 (SeparableCo (None, 1500, 16)     384         max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 1500, 3)      0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 750, 16)      0           separable_conv1d_3[0][0]         
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 750, 3)       0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
separable_conv1d_4 (SeparableCo (None, 750, 32)      656         max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 750, 32)      704         max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
add_1 (Add)                     (None, 750, 32)      0           separable_conv1d_4[0][0]         
                                                                 conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 375, 32)      0           add_1[0][0]                      
__________________________________________________________________________________________________
separable_conv1d_5 (SeparableCo (None, 375, 32)      1216        max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, 188, 32)      0           separable_conv1d_5[0][0]         
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, 375, 32)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_6 (SeparableCo (None, 188, 64)      2272        max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, 188, 32)      0           max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, 94, 64)       0           separable_conv1d_6[0][0]         
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, 94, 32)       0           max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
separable_conv1d_7 (SeparableCo (None, 94, 64)       4352        max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 94, 64)       6208        max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, 94, 64)       0           separable_conv1d_7[0][0]         
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_13 (MaxPooling1D) (None, 47, 64)       0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 47, 64)       256         max_pooling1d_13[0][0]           
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 47, 64)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 47, 64)       0           activation_1[0][0]               
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 47, 64)       256         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 47, 64)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 47, 64)       0           activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
add_3 (Add)                     (None, 47, 64)       0           max_pooling1d_13[0][0]           
                                                                 conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 47, 64)       256         add_3[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 47, 64)       0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 47, 64)       0           activation_3[0][0]               
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 47, 64)       256         conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 47, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 47, 64)       0           activation_4[0][0]               
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
add_4 (Add)                     (None, 47, 64)       0           add_3[0][0]                      
                                                                 conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 47, 64)       256         add_4[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 47, 64)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 47, 64)       0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 47, 64)       256         conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 47, 64)       0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 47, 64)       0           activation_6[0][0]               
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 47, 64)       12352       spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
add_5 (Add)                     (None, 47, 64)       0           add_4[0][0]                      
                                                                 conv1d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 47, 64)       256         add_5[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 47, 64)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 47, 64)       0           activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 47, 64)       8256        spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 47, 64)       256         conv1d_9[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 47, 64)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 47, 64)       0           activation_8[0][0]               
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
add_6 (Add)                     (None, 47, 64)       0           add_5[0][0]                      
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 47, 64)       256         add_6[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 47, 64)       0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 47, 64)       0           activation_9[0][0]               
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 47, 64)       256         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 47, 64)       0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 47, 64)       0           activation_10[0][0]              
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 47, 64)       8256        spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
add_7 (Add)                     (None, 47, 64)       0           add_6[0][0]                      
                                                                 conv1d_12[0][0]                  
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 47, 32)       10368       add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 47, 16)       528         bidirectional_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 47, 16)       64          conv1d_13[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 47, 32)       4224        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 47, 16)       528         bidirectional_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 47, 16)       64          conv1d_14[0][0]                  
__________________________________________________________________________________________________
attentionD0 (SeqSelfAttention)  [(None, 47, 16), (No 1089        batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, 47, 16)       0           batch_normalization_12[0][0]     
                                                                 attentionD0[0][0]                
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 47, 16)       32          add_8[0][0]                      
__________________________________________________________________________________________________
feed_forward_1 (FeedForward)    (None, 47, 16)       4240        layer_normalization_1[0][0]      
__________________________________________________________________________________________________
add_9 (Add)                     (None, 47, 16)       0           layer_normalization_1[0][0]      
                                                                 feed_forward_1[0][0]             
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 47, 16)       32          add_9[0][0]                      
__________________________________________________________________________________________________
attentionD (SeqSelfAttention)   [(None, 47, 16), (No 1089        layer_normalization_2[0][0]      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 47, 16)       0           layer_normalization_2[0][0]      
                                                                 attentionD[0][0]                 
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 47, 16)       32          add_10[0][0]                     
__________________________________________________________________________________________________
feed_forward_2 (FeedForward)    (None, 47, 16)       4240        layer_normalization_3[0][0]      
__________________________________________________________________________________________________
add_11 (Add)                    (None, 47, 16)       0           layer_normalization_3[0][0]      
                                                                 feed_forward_2[0][0]             
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 47, 16)       32          add_11[0][0]                     
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 47, 16)       2112        layer_normalization_4[0][0]      
__________________________________________________________________________________________________
attentionP (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_3[0][0]                     
__________________________________________________________________________________________________
attentionS (SeqSelfAttention)   [(None, 47, 16), (No 1089        lstm_4[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_1 (UpSampling1D)  (None, 94, 16)       0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
up_sampling1d_15 (UpSampling1D) (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_29 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_8 (SeparableCo (None, 94, 64)       1136        up_sampling1d_1[0][0]            
__________________________________________________________________________________________________
separable_conv1d_15 (SeparableC (None, 94, 64)       1136        up_sampling1d_15[0][0]           
__________________________________________________________________________________________________
separable_conv1d_22 (SeparableC (None, 94, 64)       1136        up_sampling1d_29[0][0]           
__________________________________________________________________________________________________
up_sampling1d_3 (UpSampling1D)  (None, 188, 64)      0           separable_conv1d_8[0][0]         
__________________________________________________________________________________________________
up_sampling1d_17 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_15[0][0]        
__________________________________________________________________________________________________
up_sampling1d_31 (UpSampling1D) (None, 188, 64)      0           separable_conv1d_22[0][0]        
__________________________________________________________________________________________________
separable_conv1d_9 (SeparableCo (None, 188, 64)      4480        up_sampling1d_3[0][0]            
__________________________________________________________________________________________________
up_sampling1d_2 (UpSampling1D)  (None, 94, 16)       0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
separable_conv1d_16 (SeparableC (None, 188, 64)      4480        up_sampling1d_17[0][0]           
__________________________________________________________________________________________________
up_sampling1d_16 (UpSampling1D) (None, 94, 16)       0           attentionP[0][0]                 
__________________________________________________________________________________________________
separable_conv1d_23 (SeparableC (None, 188, 64)      4480        up_sampling1d_31[0][0]           
__________________________________________________________________________________________________
up_sampling1d_30 (UpSampling1D) (None, 94, 16)       0           attentionS[0][0]                 
__________________________________________________________________________________________________
up_sampling1d_5 (UpSampling1D)  (None, 376, 64)      0           separable_conv1d_9[0][0]         
__________________________________________________________________________________________________
up_sampling1d_4 (UpSampling1D)  (None, 188, 16)      0           up_sampling1d_2[0][0]            
__________________________________________________________________________________________________
up_sampling1d_19 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_16[0][0]        
__________________________________________________________________________________________________
up_sampling1d_18 (UpSampling1D) (None, 188, 16)      0           up_sampling1d_16[0][0]           
__________________________________________________________________________________________________
up_sampling1d_33 (UpSampling1D) (None, 376, 64)      0           separable_conv1d_23[0][0]        
__________________________________________________________________________________________________
up_sampling1d_32 (UpSampling1D) (None, 188, 16)      0           up_sampling1d_30[0][0]           
__________________________________________________________________________________________________
separable_conv1d_10 (SeparableC (None, 376, 32)      2400        up_sampling1d_5[0][0]            
__________________________________________________________________________________________________
up_sampling1d_6 (UpSampling1D)  (None, 376, 16)      0           up_sampling1d_4[0][0]            
__________________________________________________________________________________________________
separable_conv1d_17 (SeparableC (None, 376, 32)      2400        up_sampling1d_19[0][0]           
__________________________________________________________________________________________________
up_sampling1d_20 (UpSampling1D) (None, 376, 16)      0           up_sampling1d_18[0][0]           
__________________________________________________________________________________________________
separable_conv1d_24 (SeparableC (None, 376, 32)      2400        up_sampling1d_33[0][0]           
__________________________________________________________________________________________________
up_sampling1d_34 (UpSampling1D) (None, 376, 16)      0           up_sampling1d_32[0][0]           
__________________________________________________________________________________________________
up_sampling1d_7 (UpSampling1D)  (None, 752, 32)      0           separable_conv1d_10[0][0]        
__________________________________________________________________________________________________
up_sampling1d_8 (UpSampling1D)  (None, 752, 16)      0           up_sampling1d_6[0][0]            
__________________________________________________________________________________________________
up_sampling1d_21 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_17[0][0]        
__________________________________________________________________________________________________
up_sampling1d_22 (UpSampling1D) (None, 752, 16)      0           up_sampling1d_20[0][0]           
__________________________________________________________________________________________________
up_sampling1d_35 (UpSampling1D) (None, 752, 32)      0           separable_conv1d_24[0][0]        
__________________________________________________________________________________________________
up_sampling1d_36 (UpSampling1D) (None, 752, 16)      0           up_sampling1d_34[0][0]           
__________________________________________________________________________________________________
cropping1d_1 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_7[0][0]            
__________________________________________________________________________________________________
cropping1d_2 (Cropping1D)       (None, 750, 16)      0           up_sampling1d_8[0][0]            
__________________________________________________________________________________________________
cropping1d_3 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_21[0][0]           
__________________________________________________________________________________________________
cropping1d_4 (Cropping1D)       (None, 750, 16)      0           up_sampling1d_22[0][0]           
__________________________________________________________________________________________________
cropping1d_5 (Cropping1D)       (None, 750, 32)      0           up_sampling1d_35[0][0]           
__________________________________________________________________________________________________
cropping1d_6 (Cropping1D)       (None, 750, 16)      0           up_sampling1d_36[0][0]           
__________________________________________________________________________________________________
separable_conv1d_11 (SeparableC (None, 750, 32)      1280        cropping1d_1[0][0]               
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 750, 32)      3616        cropping1d_2[0][0]               
__________________________________________________________________________________________________
separable_conv1d_18 (SeparableC (None, 750, 32)      1280        cropping1d_3[0][0]               
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 750, 32)      3616        cropping1d_4[0][0]               
__________________________________________________________________________________________________
separable_conv1d_25 (SeparableC (None, 750, 32)      1280        cropping1d_5[0][0]               
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 750, 32)      3616        cropping1d_6[0][0]               
__________________________________________________________________________________________________
add_12 (Add)                    (None, 750, 32)      0           separable_conv1d_11[0][0]        
                                                                 conv1d_15[0][0]                  
__________________________________________________________________________________________________
add_14 (Add)                    (None, 750, 32)      0           separable_conv1d_18[0][0]        
                                                                 conv1d_17[0][0]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 750, 32)      0           separable_conv1d_25[0][0]        
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_9 (UpSampling1D)  (None, 1500, 32)     0           add_12[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_23 (UpSampling1D) (None, 1500, 32)     0           add_14[0][0]                     
__________________________________________________________________________________________________
up_sampling1d_37 (UpSampling1D) (None, 1500, 32)     0           add_16[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_12 (SeparableC (None, 1500, 16)     752         up_sampling1d_9[0][0]            
__________________________________________________________________________________________________
separable_conv1d_19 (SeparableC (None, 1500, 16)     752         up_sampling1d_23[0][0]           
__________________________________________________________________________________________________
separable_conv1d_26 (SeparableC (None, 1500, 16)     752         up_sampling1d_37[0][0]           
__________________________________________________________________________________________________
up_sampling1d_11 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_12[0][0]        
__________________________________________________________________________________________________
up_sampling1d_10 (UpSampling1D) (None, 1500, 32)     0           conv1d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_25 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_19[0][0]        
__________________________________________________________________________________________________
up_sampling1d_24 (UpSampling1D) (None, 1500, 32)     0           conv1d_17[0][0]                  
__________________________________________________________________________________________________
up_sampling1d_39 (UpSampling1D) (None, 3000, 16)     0           separable_conv1d_26[0][0]        
__________________________________________________________________________________________________
up_sampling1d_38 (UpSampling1D) (None, 1500, 32)     0           conv1d_19[0][0]                  
__________________________________________________________________________________________________
separable_conv1d_13 (SeparableC (None, 3000, 16)     416         up_sampling1d_11[0][0]           
__________________________________________________________________________________________________
up_sampling1d_12 (UpSampling1D) (None, 3000, 32)     0           up_sampling1d_10[0][0]           
__________________________________________________________________________________________________
separable_conv1d_20 (SeparableC (None, 3000, 16)     416         up_sampling1d_25[0][0]           
__________________________________________________________________________________________________
up_sampling1d_26 (UpSampling1D) (None, 3000, 32)     0           up_sampling1d_24[0][0]           
__________________________________________________________________________________________________
separable_conv1d_27 (SeparableC (None, 3000, 16)     416         up_sampling1d_39[0][0]           
__________________________________________________________________________________________________
up_sampling1d_40 (UpSampling1D) (None, 3000, 32)     0           up_sampling1d_38[0][0]           
__________________________________________________________________________________________________
up_sampling1d_13 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_13[0][0]        
__________________________________________________________________________________________________
up_sampling1d_14 (UpSampling1D) (None, 6000, 32)     0           up_sampling1d_12[0][0]           
__________________________________________________________________________________________________
up_sampling1d_27 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_20[0][0]        
__________________________________________________________________________________________________
up_sampling1d_28 (UpSampling1D) (None, 6000, 32)     0           up_sampling1d_26[0][0]           
__________________________________________________________________________________________________
up_sampling1d_41 (UpSampling1D) (None, 6000, 16)     0           separable_conv1d_27[0][0]        
__________________________________________________________________________________________________
up_sampling1d_42 (UpSampling1D) (None, 6000, 32)     0           up_sampling1d_40[0][0]           
__________________________________________________________________________________________________
separable_conv1d_14 (SeparableC (None, 6000, 8)      312         up_sampling1d_13[0][0]           
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 6000, 8)      2824        up_sampling1d_14[0][0]           
__________________________________________________________________________________________________
separable_conv1d_21 (SeparableC (None, 6000, 8)      312         up_sampling1d_27[0][0]           
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 6000, 8)      2824        up_sampling1d_28[0][0]           
__________________________________________________________________________________________________
separable_conv1d_28 (SeparableC (None, 6000, 8)      312         up_sampling1d_41[0][0]           
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 6000, 8)      2824        up_sampling1d_42[0][0]           
__________________________________________________________________________________________________
add_13 (Add)                    (None, 6000, 8)      0           separable_conv1d_14[0][0]        
                                                                 conv1d_16[0][0]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 6000, 8)      0           separable_conv1d_21[0][0]        
                                                                 conv1d_18[0][0]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 6000, 8)      0           separable_conv1d_28[0][0]        
                                                                 conv1d_20[0][0]                  
__________________________________________________________________________________________________
detector (Conv1D)               (None, 6000, 1)      89          add_13[0][0]                     
__________________________________________________________________________________________________
picker_P (Conv1D)               (None, 6000, 1)      89          add_15[0][0]                     
__________________________________________________________________________________________________
picker_S (Conv1D)               (None, 6000, 1)      89          add_17[0][0]                     
==================================================================================================
Total params: 210,648
Trainable params: 209,304
Non-trainable params: 1,344
__________________________________________________________________________________________________
Started training in generator mode ...
Epoch 1/10
Learning rate:  0.001
6000/6000 [==============================] - 6468s 1s/step - loss: 0.0121 - detector_loss: 0.0644 - picker_P_loss: 0.0094 - picker_S_loss: 0.0089 - detector_f1: 0.7852 - picker_P_f1: 0.0561 - picker_S_f1: 0.0217 - val_loss: 0.0033 - val_detector_loss: 0.0152 - val_picker_P_loss: 0.0034 - val_picker_S_loss: 0.0042 - val_detector_f1: 0.9478 - val_picker_P_f1: 0.3717 - val_picker_S_f1: 0.1178

Epoch 00001: val_loss improved from inf to 0.00326, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_001.h5
Epoch 2/10
Learning rate:  0.001
6000/6000 [==============================] - 5216s 869ms/step - loss: 0.0068 - detector_loss: 0.0300 - picker_P_loss: 0.0053 - picker_S_loss: 0.0055 - detector_f1: 0.9072 - picker_P_f1: 0.3319 - picker_S_f1: 0.1806 - val_loss: 0.0029 - val_detector_loss: 0.0139 - val_picker_P_loss: 0.0030 - val_picker_S_loss: 0.0039 - val_detector_f1: 0.9484 - val_picker_P_f1: 0.5163 - val_picker_S_f1: 0.3038

Epoch 00002: val_loss improved from 0.00326 to 0.00287, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_002.h5
Epoch 3/10
Learning rate:  0.001
6000/6000 [==============================] - 5135s 856ms/step - loss: 0.0061 - detector_loss: 0.0248 - picker_P_loss: 0.0048 - picker_S_loss: 0.0051 - detector_f1: 0.9227 - picker_P_f1: 0.4221 - picker_S_f1: 0.2602 - val_loss: 0.0029 - val_detector_loss: 0.0101 - val_picker_P_loss: 0.0027 - val_picker_S_loss: 0.0037 - val_detector_f1: 0.9631 - val_picker_P_f1: 0.5234 - val_picker_S_f1: 0.2988

Epoch 00003: val_loss did not improve from 0.00287
Epoch 4/10
Learning rate:  0.001
6000/6000 [==============================] - 5072s 845ms/step - loss: 0.0058 - detector_loss: 0.0232 - picker_P_loss: 0.0046 - picker_S_loss: 0.0050 - detector_f1: 0.9276 - picker_P_f1: 0.4583 - picker_S_f1: 0.3033 - val_loss: 0.0027 - val_detector_loss: 0.0088 - val_picker_P_loss: 0.0026 - val_picker_S_loss: 0.0036 - val_detector_f1: 0.9683 - val_picker_P_f1: 0.6019 - val_picker_S_f1: 0.3576

Epoch 00004: val_loss improved from 0.00287 to 0.00271, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_004.h5
Epoch 5/10
Learning rate:  0.001
6000/6000 [==============================] - 4941s 824ms/step - loss: 0.0056 - detector_loss: 0.0217 - picker_P_loss: 0.0044 - picker_S_loss: 0.0049 - detector_f1: 0.9338 - picker_P_f1: 0.4802 - picker_S_f1: 0.3261 - val_loss: 0.0024 - val_detector_loss: 0.0090 - val_picker_P_loss: 0.0022 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9700 - val_picker_P_f1: 0.6615 - val_picker_S_f1: 0.4230

Epoch 00005: val_loss improved from 0.00271 to 0.00237, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_005.h5
Epoch 6/10
Learning rate:  0.001
6000/6000 [==============================] - 4856s 809ms/step - loss: 0.0054 - detector_loss: 0.0205 - picker_P_loss: 0.0043 - picker_S_loss: 0.0047 - detector_f1: 0.9361 - picker_P_f1: 0.4938 - picker_S_f1: 0.3423 - val_loss: 0.0030 - val_detector_loss: 0.0109 - val_picker_P_loss: 0.0022 - val_picker_S_loss: 0.0036 - val_detector_f1: 0.9608 - val_picker_P_f1: 0.6598 - val_picker_S_f1: 0.3981

Epoch 00006: val_loss did not improve from 0.00237
Epoch 7/10
Learning rate:  0.001
6000/6000 [==============================] - 4840s 807ms/step - loss: 0.0054 - detector_loss: 0.0200 - picker_P_loss: 0.0042 - picker_S_loss: 0.0047 - detector_f1: 0.9373 - picker_P_f1: 0.5014 - picker_S_f1: 0.3558 - val_loss: 0.0021 - val_detector_loss: 0.0064 - val_picker_P_loss: 0.0021 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9766 - val_picker_P_f1: 0.6764 - val_picker_S_f1: 0.4481

Epoch 00007: val_loss improved from 0.00237 to 0.00213, saving model to C:\Users\JeoungSeoungHeong\EQ\EQTransformer_master\test_trainer_outputs\models\test_trainer_007.h5
Epoch 8/10
Learning rate:  0.001
6000/6000 [==============================] - 4704s 784ms/step - loss: 0.0052 - detector_loss: 0.0192 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9399 - picker_P_f1: 0.5102 - picker_S_f1: 0.3669 - val_loss: 0.0024 - val_detector_loss: 0.0070 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0034 - val_detector_f1: 0.9740 - val_picker_P_f1: 0.6748 - val_picker_S_f1: 0.3659

Epoch 00008: val_loss did not improve from 0.00213
Epoch 9/10
Learning rate:  0.001
6000/6000 [==============================] - 4645s 774ms/step - loss: 0.0052 - detector_loss: 0.0190 - picker_P_loss: 0.0041 - picker_S_loss: 0.0046 - detector_f1: 0.9406 - picker_P_f1: 0.5171 - picker_S_f1: 0.3779 - val_loss: 0.0023 - val_detector_loss: 0.0066 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0033 - val_detector_f1: 0.9761 - val_picker_P_f1: 0.6936 - val_picker_S_f1: 0.4497

Epoch 00009: val_loss did not improve from 0.00213
Epoch 10/10
Learning rate:  0.001
6000/6000 [==============================] - 4631s 772ms/step - loss: 0.0051 - detector_loss: 0.0184 - picker_P_loss: 0.0041 - picker_S_loss: 0.0045 - detector_f1: 0.9427 - picker_P_f1: 0.5225 - picker_S_f1: 0.3876 - val_loss: 0.0022 - val_detector_loss: 0.0059 - val_picker_P_loss: 0.0020 - val_picker_S_loss: 0.0032 - val_detector_f1: 0.9779 - val_picker_P_f1: 0.6704 - val_picker_S_f1: 0.4112

Epoch 00010: val_loss did not improve from 0.00213
